{"format": "graph-model", "generatedBy": "2.0.0-dev20190412", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"node": [{"name": "input_6", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "48"}, {"size": "48"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv_pw_13_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv1_pad/Pad/paddings", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "conv_pw_11_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_11/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_11/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "conv_dw_10_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_10_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_9/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_pw_8/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_8/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7/Conv2D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "conv_dw_7_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv_dw_7/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv_pw_6_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "conv_pw_5/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}}, {"name": "conv_pw_4_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "conv_dw_4_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3/depthwise_kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "conv_pw_2/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv_dw_2/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}}}}}, {"name": "conv_pw_1_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "conv_pw_1/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_dw_1_bn/FusedBatchNorm/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv_dw_1/depthwise_kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "conv1_bn/FusedBatchNorm/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "conv1/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1_pad/Pad", "op": "Pad", "input": ["input_6", "conv1_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv1_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv1_pad/Pad", "conv1/Conv2D/merged_input"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv1_bn/FusedBatchNorm", "op": "Add", "input": ["conv1_bn/FusedBatchNorm/Mul", "conv1_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1_relu/Relu6", "op": "Relu6", "input": ["conv1_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv1_relu/Relu6", "conv_dw_1/depthwise_kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_1_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_1/depthwise", "conv_dw_1_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_1_bn/FusedBatchNorm/Mul", "conv_dw_1_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_1_relu/Relu6", "op": "Relu6", "input": ["conv_dw_1_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_1_relu/Relu6", "conv_pw_1/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv_pw_1_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_1_bn/FusedBatchNorm/Mul", "conv_pw_1_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_1_relu/Relu6", "op": "Relu6", "input": ["conv_pw_1_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_2/Pad", "op": "Pad", "input": ["conv_pw_1_relu/Relu6", "conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_2/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pad_2/Pad", "conv_dw_2/depthwise_kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_2_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_2/depthwise", "conv_dw_2_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_2_bn/FusedBatchNorm/Mul", "conv_dw_2_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_2_relu/Relu6", "op": "Relu6", "input": ["conv_dw_2_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_2_relu/Relu6", "conv_pw_2/Conv2D/merged_input"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_2_bn/FusedBatchNorm/Mul", "conv_pw_2_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_2_relu/Relu6", "op": "Relu6", "input": ["conv_pw_2_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_2_relu/Relu6", "conv_dw_3/depthwise_kernel"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_3/depthwise", "conv_dw_3_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_3_bn/FusedBatchNorm/Mul", "conv_dw_3_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_3_relu/Relu6", "op": "Relu6", "input": ["conv_dw_3_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_3_relu/Relu6", "conv_pw_3/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv_pw_3_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_3_bn/FusedBatchNorm/Mul", "conv_pw_3_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_3_relu/Relu6", "op": "Relu6", "input": ["conv_pw_3_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_4/Pad", "op": "Pad", "input": ["conv_pw_3_relu/Relu6", "conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_4/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pad_4/Pad", "conv_dw_4/depthwise_kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv_dw_4_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_4/depthwise", "conv_dw_4_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_4_bn/FusedBatchNorm/Mul", "conv_dw_4_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_4_relu/Relu6", "op": "Relu6", "input": ["conv_dw_4_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_4_relu/Relu6", "conv_pw_4/Conv2D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pw_4_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_4_bn/FusedBatchNorm/Mul", "conv_pw_4_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_4_relu/Relu6", "op": "Relu6", "input": ["conv_pw_4_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_4_relu/Relu6", "conv_dw_5/depthwise_kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_5_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_5/depthwise", "conv_dw_5_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_5_bn/FusedBatchNorm/Mul", "conv_dw_5_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_5_relu/Relu6", "op": "Relu6", "input": ["conv_dw_5_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_5_relu/Relu6", "conv_pw_5/Conv2D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pw_5_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_5_bn/FusedBatchNorm/Mul", "conv_pw_5_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_5_relu/Relu6", "op": "Relu6", "input": ["conv_pw_5_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_6/Pad", "op": "Pad", "input": ["conv_pw_5_relu/Relu6", "conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "conv_dw_6/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pad_6/Pad", "conv_dw_6/depthwise_kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_6_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_6/depthwise", "conv_dw_6_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_6_bn/FusedBatchNorm/Mul", "conv_dw_6_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_6_relu/Relu6", "op": "Relu6", "input": ["conv_dw_6_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_6_relu/Relu6", "conv_pw_6/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv_pw_6_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_6_bn/FusedBatchNorm/Mul", "conv_pw_6_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_6_relu/Relu6", "op": "Relu6", "input": ["conv_pw_6_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_6_relu/Relu6", "conv_dw_7/depthwise_kernel"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_7/depthwise", "conv_dw_7_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_7_bn/FusedBatchNorm/Mul", "conv_dw_7_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_7_relu/Relu6", "op": "Relu6", "input": ["conv_dw_7_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_7_relu/Relu6", "conv_pw_7/Conv2D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pw_7_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_7_bn/FusedBatchNorm/Mul", "conv_pw_7_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_7_relu/Relu6", "op": "Relu6", "input": ["conv_pw_7_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_7_relu/Relu6", "conv_dw_8/depthwise_kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_dw_8_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_8/depthwise", "conv_dw_8_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_8_bn/FusedBatchNorm/Mul", "conv_dw_8_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_8_relu/Relu6", "op": "Relu6", "input": ["conv_dw_8_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_8_relu/Relu6", "conv_pw_8/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv_pw_8_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_8_bn/FusedBatchNorm/Mul", "conv_pw_8_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_8_relu/Relu6", "op": "Relu6", "input": ["conv_pw_8_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_8_relu/Relu6", "conv_dw_9/depthwise_kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_9_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_9/depthwise", "conv_dw_9_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_9_bn/FusedBatchNorm/Mul", "conv_dw_9_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_9_relu/Relu6", "op": "Relu6", "input": ["conv_dw_9_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_9_relu/Relu6", "conv_pw_9/Conv2D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_pw_9_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_9_bn/FusedBatchNorm/Mul", "conv_pw_9_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_9_relu/Relu6", "op": "Relu6", "input": ["conv_pw_9_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_9_relu/Relu6", "conv_dw_10/depthwise_kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv_dw_10_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_10/depthwise", "conv_dw_10_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_10_bn/FusedBatchNorm/Mul", "conv_dw_10_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_10_relu/Relu6", "op": "Relu6", "input": ["conv_dw_10_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_10_relu/Relu6", "conv_pw_10/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv_pw_10_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_10_bn/FusedBatchNorm/Mul", "conv_pw_10_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_10_relu/Relu6", "op": "Relu6", "input": ["conv_pw_10_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_10_relu/Relu6", "conv_dw_11/depthwise_kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv_dw_11_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_11/depthwise", "conv_dw_11_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_11_bn/FusedBatchNorm/Mul", "conv_dw_11_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_11_relu/Relu6", "op": "Relu6", "input": ["conv_dw_11_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_11_relu/Relu6", "conv_pw_11/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv_pw_11_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_11_bn/FusedBatchNorm/Mul", "conv_pw_11_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_11_relu/Relu6", "op": "Relu6", "input": ["conv_pw_11_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pad_12/Pad", "op": "Pad", "input": ["conv_pw_11_relu/Relu6", "conv1_pad/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pad_12/Pad", "conv_dw_12/depthwise_kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv_dw_12_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_12/depthwise", "conv_dw_12_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_12_bn/FusedBatchNorm/Mul", "conv_dw_12_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_12_relu/Relu6", "op": "Relu6", "input": ["conv_dw_12_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_12_relu/Relu6", "conv_pw_12/Conv2D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv_pw_12_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_12_bn/FusedBatchNorm/Mul", "conv_pw_12_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_12_relu/Relu6", "op": "Relu6", "input": ["conv_pw_12_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13/depthwise", "op": "DepthwiseConv2dNative", "input": ["conv_pw_12_relu/Relu6", "conv_dw_13/depthwise_kernel"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn/FusedBatchNorm/Mul", "op": "Mul", "input": ["conv_dw_13/depthwise", "conv_dw_13_bn/FusedBatchNorm/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_bn/FusedBatchNorm", "op": "Add", "input": ["conv_dw_13_bn/FusedBatchNorm/Mul", "conv_dw_13_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_dw_13_relu/Relu6", "op": "Relu6", "input": ["conv_dw_13_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_bn/FusedBatchNorm/Mul", "op": "Conv2D", "input": ["conv_dw_13_relu/Relu6", "conv_pw_13/Conv2D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv_pw_13_bn/FusedBatchNorm", "op": "Add", "input": ["conv_pw_13_bn/FusedBatchNorm/Mul", "conv_pw_13_bn/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv_pw_13_relu/Relu6", "op": "Relu6", "input": ["conv_pw_13_bn/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "reshape/Shape", "op": "Shape", "input": ["conv_pw_13_relu/Relu6"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "reshape/strided_slice", "op": "StridedSlice", "input": ["reshape/Shape", "reshape/strided_slice/stack", "reshape/strided_slice/stack_1", "reshape/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "reshape/Reshape/shape", "op": "Pack", "input": ["reshape/strided_slice", "reshape/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "reshape/Reshape", "op": "Reshape", "input": ["conv_pw_13_relu/Relu6", "reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/MatMul", "op": "MatMul", "input": ["reshape/Reshape", "dense/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense/BiasAdd", "op": "BiasAdd", "input": ["dense/MatMul", "dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense/Softmax", "op": "Softmax", "input": ["dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 29}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "dense/bias", "shape": [7], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1024, 7], "dtype": "float32"}, {"name": "reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "conv_pw_13_bn/FusedBatchNorm/Offset", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_13/Conv2D/merged_input", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/FusedBatchNorm/Offset", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13_bn/FusedBatchNorm/Scaled", "shape": [1024], "dtype": "float32"}, {"name": "conv_dw_13/depthwise_kernel", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "conv_pw_12_bn/FusedBatchNorm/Offset", "shape": [1024], "dtype": "float32"}, {"name": "conv_pw_12/Conv2D/merged_input", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv_dw_12_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_12/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv1_pad/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "conv_pw_11_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_11/Conv2D/merged_input", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_dw_11_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_11/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_pw_10_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_10/Conv2D/merged_input", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_dw_10_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_10/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_pw_9_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_9/Conv2D/merged_input", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_dw_9_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_9/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_pw_8_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_8/Conv2D/merged_input", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_dw_8_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_8/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_pw_7_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_7/Conv2D/merged_input", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "conv_dw_7_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7_bn/FusedBatchNorm/Scaled", "shape": [512], "dtype": "float32"}, {"name": "conv_dw_7/depthwise_kernel", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "conv_pw_6_bn/FusedBatchNorm/Offset", "shape": [512], "dtype": "float32"}, {"name": "conv_pw_6/Conv2D/merged_input", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv_dw_6_bn/FusedBatchNorm/Offset", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6_bn/FusedBatchNorm/Scaled", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_6/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_pw_5_bn/FusedBatchNorm/Offset", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_5/Conv2D/merged_input", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "conv_dw_5_bn/FusedBatchNorm/Offset", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5_bn/FusedBatchNorm/Scaled", "shape": [256], "dtype": "float32"}, {"name": "conv_dw_5/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "conv_pw_4_bn/FusedBatchNorm/Offset", "shape": [256], "dtype": "float32"}, {"name": "conv_pw_4/Conv2D/merged_input", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "conv_dw_4_bn/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4_bn/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_4/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_pw_3_bn/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_3/Conv2D/merged_input", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "conv_dw_3_bn/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3_bn/FusedBatchNorm/Scaled", "shape": [128], "dtype": "float32"}, {"name": "conv_dw_3/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "conv_pw_2_bn/FusedBatchNorm/Offset", "shape": [128], "dtype": "float32"}, {"name": "conv_pw_2/Conv2D/merged_input", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv_dw_2_bn/FusedBatchNorm/Offset", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2_bn/FusedBatchNorm/Scaled", "shape": [64], "dtype": "float32"}, {"name": "conv_dw_2/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv_pw_1_bn/FusedBatchNorm/Offset", "shape": [64], "dtype": "float32"}, {"name": "conv_pw_1/Conv2D/merged_input", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv_dw_1_bn/FusedBatchNorm/Offset", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1_bn/FusedBatchNorm/Scaled", "shape": [32], "dtype": "float32"}, {"name": "conv_dw_1/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "conv1_bn/FusedBatchNorm/Offset", "shape": [32], "dtype": "float32"}, {"name": "conv1/Conv2D/merged_input", "shape": [3, 3, 1, 32], "dtype": "float32"}]}]}